In [6]:
import awswrangler as wr
import pandas as pd
from os import getenv
import boto3

In [4]:
from dotenv import load_dotenv

load_dotenv()

True

In [11]:
bucket_path = f's3://{getenv("S3_BUCKET_NAME")}'
session = boto3.Session(aws_access_key_id=getenv("ACCESS_KEY_ID"), aws_secret_access_key=getenv("SECRET_ACCESS_KEY"))
raw_data = wr.s3.list_objects(
    bucket_path,
    suffix='.csv',
    boto3_session=session,
)
raw_data

['s3://alcon-workshop-data-348390760357/28-11-2023_22.csv',
 's3://alcon-workshop-data-348390760357/28-11-2023_23.csv']

In [13]:
df = wr.s3.read_csv(
    raw_data,
    sep=',',
    index_col=False,
)
df

,Unnamed: 0,FIRST_NAME,LAST_NAME,SEX,AGE,DATE_DIED,INGESTION_DATETIME
0,0,Karyme,Cartwright,Male,95.0,2023-10-28,2023-11-28 21:22:07
1,1,Leota,Schmitt,Male,76.0,9999-99-99,2023-11-28 21:22:07
2,2,Julio,Fritsch,Male,72.0,2023-10-28,2023-11-28 21:22:07
3,3,Noemie,Swaniawski,Male,90.0,2023-10-28,2023-11-28 21:22:07
4,4,Ofelia,Hettinger,Male,12.0,2023-10-28,2023-11-28 21:22:07
...,...,...,...,...,...,...,...
195,195,Forest,Stamm,Male,45.0,2023-10-28,2023-11-28 22:52:06
196,196,Dagmar,Prohaska,Female,2.0,2023-10-28,2023-11-28 22:52:06
197,197,Arden,Hudson,Female,NaN,2023-10-28,2023-11-28 22:52:06
198,198,Jemima,Swift,Female,60.0,2023-10-28,2023-11-28 22:52:06
199,199,Reynolds,Walker,Male,12.0,2023-10-28,2023-11-28 22:52:06

In [15]:
df.columns

Index(['Unnamed: 0', 'FIRST_NAME', 'LAST_NAME', 'SEX', 'AGE', 'DATE_DIED',
       'INGESTION_DATETIME'],
      dtype='object')

In [18]:
df = df.drop('Unnamed: 0', axis=1)
df

    FIRST_NAME   LAST_NAME     SEX   AGE   DATE_DIED   INGESTION_DATETIME
0       Karyme  Cartwright    Male  95.0  2023-10-28  2023-11-28 21:22:07
1        Leota     Schmitt    Male  76.0  9999-99-99  2023-11-28 21:22:07
2        Julio     Fritsch    Male  72.0  2023-10-28  2023-11-28 21:22:07
3       Noemie  Swaniawski    Male  90.0  2023-10-28  2023-11-28 21:22:07
4       Ofelia   Hettinger    Male  12.0  2023-10-28  2023-11-28 21:22:07
..         ...         ...     ...   ...         ...                  ...
195     Forest       Stamm    Male  45.0  2023-10-28  2023-11-28 22:52:06
196     Dagmar    Prohaska  Female   2.0  2023-10-28  2023-11-28 22:52:06
197      Arden      Hudson  Female   NaN  2023-10-28  2023-11-28 22:52:06
198     Jemima       Swift  Female  60.0  2023-10-28  2023-11-28 22:52:06
199   Reynolds      Walker    Male  12.0  2023-10-28  2023-11-28 22:52:06

[400 rows x 6 columns]

In [29]:
df.sort_values(by='AGE')

    FIRST_NAME  LAST_NAME     SEX  AGE   DATE_DIED   INGESTION_DATETIME
196     Dagmar   Prohaska  Female  2.0  2023-10-28  2023-11-28 21:52:06
196     Dagmar   Prohaska  Female  2.0  2023-10-28  2023-11-28 22:52:06
96      Dagmar   Prohaska  Female  2.0  2023-10-28  2023-11-28 21:22:07
96      Dagmar   Prohaska  Female  2.0  2023-10-28  2023-11-28 22:22:06
189     Author    Gleason    Male  3.0  2023-10-28  2023-11-28 22:52:06
..         ...        ...     ...  ...         ...                  ...
97       Arden     Hudson  Female  NaN  2023-10-28  2023-11-28 22:22:06
116      Clara      Boyle    Male  NaN  2023-10-28  2023-11-28 22:52:06
128     Charls    Wuckert    Male  NaN  2023-10-28  2023-11-28 22:52:06
137     Amirah  Romaguera  Female  NaN  9999-99-99  2023-11-28 22:52:06
197      Arden     Hudson  Female  NaN  2023-10-28  2023-11-28 22:52:06

[400 rows x 6 columns]

In [25]:
df.sort_values(by='AGE', ascending=False)

    FIRST_NAME  LAST_NAME     SEX    AGE   DATE_DIED   INGESTION_DATETIME
123   Thorwald    Wiegand  Female  165.0  2023-10-28  2023-11-28 21:52:06
23    Thorwald    Wiegand  Female  165.0  2023-10-28  2023-11-28 21:22:07
23    Thorwald    Wiegand  Female  165.0  2023-10-28  2023-11-28 22:22:06
123   Thorwald    Wiegand  Female  165.0  2023-10-28  2023-11-28 22:52:06
148      Cyndi     Legros  Female  154.0  2023-10-28  2023-11-28 22:52:06
..         ...        ...     ...    ...         ...                  ...
97       Arden     Hudson  Female    NaN  2023-10-28  2023-11-28 22:22:06
116      Clara      Boyle    Male    NaN  2023-10-28  2023-11-28 22:52:06
128     Charls    Wuckert    Male    NaN  2023-10-28  2023-11-28 22:52:06
137     Amirah  Romaguera  Female    NaN  9999-99-99  2023-11-28 22:52:06
197      Arden     Hudson  Female    NaN  2023-10-28  2023-11-28 22:52:06

[400 rows x 6 columns]

In [28]:
df.sort_values(by='AGE', ascending=False).drop_duplicates('AGE')

    FIRST_NAME LAST_NAME     SEX    AGE   DATE_DIED   INGESTION_DATETIME
123   Thorwald   Wiegand  Female  165.0  2023-10-28  2023-11-28 21:52:06
148      Cyndi    Legros  Female  154.0  2023-10-28  2023-11-28 22:52:06
191     Jalynn     O'Kon    Male  100.0  2023-10-28  2023-11-28 21:52:06
180     Sylvia     Kling  Female   99.0  2023-10-28  2023-11-28 22:52:06
171   Franklin   Quitzon    Male   97.0  2023-10-28  2023-11-28 22:52:06
..         ...       ...     ...    ...         ...                  ...
131    Leilani   Quigley    Male    8.0  2023-10-28  2023-11-28 21:52:06
72     Julious     Dicki  Female    7.0  2023-10-28  2023-11-28 21:22:07
187     Tameka  Bogisich  Female    3.0  9999-99-99  2023-11-28 22:52:06
96      Dagmar  Prohaska  Female    2.0  2023-10-28  2023-11-28 21:22:07
16       Clara     Boyle    Male    NaN  2023-10-28  2023-11-28 21:22:07

[64 rows x 6 columns]

In [30]:
cleaned = df[df['AGE'] <= 100]
cleaned

    FIRST_NAME   LAST_NAME     SEX   AGE   DATE_DIED   INGESTION_DATETIME
0       Karyme  Cartwright    Male  95.0  2023-10-28  2023-11-28 21:22:07
1        Leota     Schmitt    Male  76.0  9999-99-99  2023-11-28 21:22:07
2        Julio     Fritsch    Male  72.0  2023-10-28  2023-11-28 21:22:07
3       Noemie  Swaniawski    Male  90.0  2023-10-28  2023-11-28 21:22:07
4       Ofelia   Hettinger    Male  12.0  2023-10-28  2023-11-28 21:22:07
..         ...         ...     ...   ...         ...                  ...
194      Ludie       Smith  Female  88.0  9999-99-99  2023-11-28 22:52:06
195     Forest       Stamm    Male  45.0  2023-10-28  2023-11-28 22:52:06
196     Dagmar    Prohaska  Female   2.0  2023-10-28  2023-11-28 22:52:06
198     Jemima       Swift  Female  60.0  2023-10-28  2023-11-28 22:52:06
199   Reynolds      Walker    Male  12.0  2023-10-28  2023-11-28 22:52:06

[376 rows x 6 columns]

In [31]:
cleaned.sort_values(by='AGE', ascending=False).drop_duplicates('AGE')

    FIRST_NAME   LAST_NAME     SEX    AGE   DATE_DIED   INGESTION_DATETIME
91      Jalynn       O'Kon    Male  100.0  2023-10-28  2023-11-28 22:22:06
76     Natalya     Gleason  Female   99.0  2023-10-28  2023-11-28 22:22:06
171   Franklin     Quitzon    Male   97.0  2023-10-28  2023-11-28 21:52:06
38       Merry     McGlynn    Male   96.0  9999-99-99  2023-11-28 22:22:06
100     Karyme  Cartwright    Male   95.0  2023-10-28  2023-11-28 21:52:06
..         ...         ...     ...    ...         ...                  ...
126    Edgardo     Gleason    Male    9.0  2023-10-28  2023-11-28 21:52:06
139     Cassie      Littel    Male    8.0  9999-99-99  2023-11-28 21:52:06
72     Julious       Dicki  Female    7.0  2023-10-28  2023-11-28 21:22:07
187     Tameka    Bogisich  Female    3.0  9999-99-99  2023-11-28 22:52:06
96      Dagmar    Prohaska  Female    2.0  2023-10-28  2023-11-28 21:22:07

[61 rows x 6 columns]